
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 4 to change, 3 to destroy.</code></pre>

* Create
  * module.storage-account.azapi_update_resource.defender_settings
  * module.storage-account.time_rotating.rotate
  * module.storage-account.time_static.pim_expiry
  * module.storage-account.time_static.pim_start
* Update
  * module.application_insights_main.azurerm_application_insights.this
  * module.application_insights_preview[0].azurerm_application_insights.this
  * module.etapi-redis.azurerm_redis_cache.redis
  * module.storage-account.azurerm_storage_account.storage_account
* Replace
  * module.et-database.null_resource.set-user-permissions-additionaldbs[&#34;et1&#34;]
  * module.et-database.null_resource.set-user-permissions-additionaldbs[&#34;et3&#34;]
  * module.et-database.null_resource.set-user-permissions-additionaldbs[&#34;etapi&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights_main.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Insights/components/et-pet-appinsights-aat"
        name                                  = "et-pet-appinsights-aat"
        tags                                  = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (14 unchanged attributes hidden)
    }

  # module.application_insights_preview[0].azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights_preview[0])
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Insights/components/et-pet-appinsights-preview"
        name                                  = "et-pet-appinsights-preview"
        tags                                  = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (14 unchanged attributes hidden)
    }

  # module.et-database.null_resource.set-user-permissions-additionaldbs["et1"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "6418717951361525724" -> (known after apply)
      ~ triggers = { # forces replacement
          + "force_trigger"  = ""
          ~ "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93" -> "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
            # (2 unchanged elements hidden)
        }
    }

  # module.et-database.null_resource.set-user-permissions-additionaldbs["et3"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "2054591923053398409" -> (known after apply)
      ~ triggers = { # forces replacement
          + "force_trigger"  = ""
          ~ "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93" -> "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
            # (2 unchanged elements hidden)
        }
    }

  # module.et-database.null_resource.set-user-permissions-additionaldbs["etapi"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "8027443722909917092" -> (known after apply)
      ~ triggers = { # forces replacement
          + "force_trigger"  = ""
          ~ "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93" -> "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
            # (2 unchanged elements hidden)
        }
    }

  # module.etapi-redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-cache-aat/providers/Microsoft.Cache/redis/et-pet-api-aat"
        name                          = "et-pet-api-aat"
        tags                          = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (8 unchanged attributes hidden)
        }
    }

  # module.storage-account.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Storage/storageAccounts/etpetsaaat"
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage-account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.Storage/storageAccounts/etpetsaaat"
        name                              = "etpetsaaat"
        tags                              = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage-account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage-account.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage-account.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 7 to add, 4 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Vars":{}} -->